{
  "juzs": {
    "juz": [
      {
        "index": "1",
        "sura": "1",
        "aya": "1",
        "name": "الفاتحة",
        "tname": "Al-Faatiha",
        "ename": "The Opening",
        "text": "بِسْمِ ٱللَّهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ"
      },
      {
        "index": "2",
        "sura": "2",
        "aya": "142",
        "name": "البقرة",
        "tname": "Al-Baqara",
        "ename": "The Cow",
        "text": "سَيَقُولُ ٱلسُّفَهَآءُ مِنَ ٱلنَّاسِ مَا وَلَّىٰهُمْ عَن قِبْلَتِهِمُ ٱلَّتِى كَانُوا۟ عَلَيْهَا قُل لِّلَّهِ ٱلْمَشْرِقُ وَٱلْمَغْرِبُ يَهْدِى مَن يَشَآءُ إِلَىٰ صِرَٰطٍ مُّسْتَقِيمٍ"
      },
      {
        "index": "3",
        "sura": "2",
        "aya": "253",
        "name": "البقرة",
        "tname": "Al-Baqara",
        "ename": "The Cow",
        "text": "تِلْكَ ٱلرُّسُلُ فَضَّلْنَا بَعْضَهُمْ عَلَىٰ بَعْضٍ مِّنْهُم مَّن كَلَّمَ ٱللَّهُ وَرَفَعَ بَعْضَهُمْ دَرَجَٰتٍ وَءَاتَيْنَا عِيسَى ٱبْنَ مَرْيَمَ ٱلْبَيِّنَٰتِ وَأَيَّدْنَٰهُ بِرُوحِ ٱلْقُدُسِ وَلَوْ شَآءَ ٱللَّهُ مَا ٱقْتَتَلَ ٱلَّذِينَ مِنۢ بَعْدِهِم مِّنۢ بَعْدِ مَا جَآءَتْهُمُ ٱلْبَيِّنَٰتُ وَلَٰكِنِ ٱخْتَلَفُوا۟ فَمِنْهُم مَّنْ ءَامَنَ وَمِنْهُم مَّن كَفَرَ وَلَوْ شَآءَ ٱللَّهُ مَا ٱقْتَتَلُوا۟ وَلَٰكِنَّ ٱللَّهَ يَفْعَلُ مَا يُرِيدُ"
      },
      {
        "index": "4",
        "sura": "3",
        "aya": "93",
        "name": "آل عمران",
        "tname": "Aal-i-Imraan",
        "ename": "The Family of Imraan",
        "text": "كُلُّ ٱلطَّعَامِ كَانَ حِلًّا لِّبَنِىٓ إِسْرَٰٓءِيلَ إِلَّا مَا حَرَّمَ إِسْرَٰٓءِيلُ عَلَىٰ نَفْسِهِۦ مِن قَبْلِ أَن تُنَزَّلَ ٱلتَّوْرَىٰةُ قُلْ فَأْتُوا۟ بِٱلتَّوْرَىٰةِ فَٱتْلُوهَآ إِن كُنتُمْ صَٰدِقِينَ"
      },
      {
        "index": "5",
        "sura": "4",
        "aya": "24",
        "name": "النساء",
        "tname": "An-Nisaa",
        "ename": "The Women",
        "text": "وَٱلْمُحْصَنَٰتُ مِنَ ٱلنِّسَآءِ إِلَّا مَا مَلَكَتْ أَيْمَٰنُكُمْ كِتَٰبَ ٱللَّهِ عَلَيْكُمْ وَأُحِلَّ لَكُم مَّا وَرَآءَ ذَٰلِكُمْ أَن تَبْتَغُوا۟ بِأَمْوَٰلِكُم مُّحْصِنِينَ غَيْرَ مُسَٰفِحِينَ فَمَا ٱسْتَمْتَعْتُم بِهِۦ مِنْهُنَّ فَـَٔاتُوهُنَّ أُجُورَهُنَّ فَرِيضَةً وَلَا جُنَاحَ عَلَيْكُمْ فِيمَا تَرَٰضَيْتُم بِهِۦ مِنۢ بَعْدِ ٱلْفَرِيضَةِ إِنَّ ٱللَّهَ كَانَ عَلِيمًا حَكِيمًا"
      },
      {
        "index": "6",
        "sura": "4",
        "aya": "148",
        "name": "النساء",
        "tname": "An-Nisaa",
        "ename": "The Women",
        "text": "لَّا يُحِبُّ ٱللَّهُ ٱلْجَهْرَ بِٱلسُّوٓءِ مِنَ ٱلْقَوْلِ إِلَّا مَن ظُلِمَ وَكَانَ ٱللَّهُ سَمِيعًا عَلِيمًا"
      },
      {
        "index": "7",
        "sura": "5",
        "aya": "82",
        "name": "المائدة",
        "tname": "Al-Maaida",
        "ename": "The Table",
        "text": "لَتَجِدَنَّ أَشَدَّ ٱلنَّاسِ عَدَٰوَةً لِّلَّذِينَ ءَامَنُوا۟ ٱلْيَهُودَ وَٱلَّذِينَ أَشْرَكُوا۟ وَلَتَجِدَنَّ أَقْرَبَهُم مَّوَدَّةً لِّلَّذِينَ ءَامَنُوا۟ ٱلَّذِينَ قَالُوٓا۟ إِنَّا نَصَٰرَىٰ ذَٰلِكَ بِأَنَّ مِنْهُمْ قِسِّيسِينَ وَرُهْبَانًا وَأَنَّهُمْ لَا يَسْتَكْبِرُونَ"
      },
      {
        "index": "8",
        "sura": "6",
        "aya": "111",
        "name": "الأنعام",
        "tname": "Al-An'aam",
        "ename": "The Cattle",
        "text": "وَلَوْ أَنَّنَا نَزَّلْنَآ إِلَيْهِمُ ٱلْمَلَٰٓئِكَةَ وَكَلَّمَهُمُ ٱلْمَوْتَىٰ وَحَشَرْنَا عَلَيْهِمْ كُلَّ شَىْءٍ قُبُلًا مَّا كَانُوا۟ لِيُؤْمِنُوٓا۟ إِلَّآ أَن يَشَآءَ ٱللَّهُ وَلَٰكِنَّ أَكْثَرَهُمْ يَجْهَلُونَ"
      },
      {
        "index": "9",
        "sura": "7",
        "aya": "88",
        "name": "الأعراف",
        "tname": "Al-A'raaf",
        "ename": "The Heights",
        "text": "قَالَ ٱلْمَلَأُ ٱلَّذِينَ ٱسْتَكْبَرُوا۟ مِن قَوْمِهِۦ لَنُخْرِجَنَّكَ يَٰشُعَيْبُ وَٱلَّذِينَ ءَامَنُوا۟ مَعَكَ مِن قَرْيَتِنَآ أَوْ لَتَعُودُنَّ فِى مِلَّتِنَا قَالَ أَوَلَوْ كُنَّا كَٰرِهِينَ"
      },
      {
        "index": "10",
        "sura": "8",
        "aya": "41",
        "name": "الأنفال",
        "tname": "Al-Anfaal",
        "ename": "The Spoils of War",
        "text": "وَٱعْلَمُوٓا۟ أَنَّمَا غَنِمْتُم مِّن شَىْءٍ فَأَنَّ لِلَّهِ خُمُسَهُۥ وَلِلرَّسُولِ وَلِذِى ٱلْقُرْبَىٰ وَٱلْيَتَٰمَىٰ وَٱلْمَسَٰكِينِ وَٱبْنِ ٱلسَّبِيلِ إِن كُنتُمْ ءَامَنتُم بِٱللَّهِ وَمَآ أَنزَلْنَا عَلَىٰ عَبْدِنَا يَوْمَ ٱلْفُرْقَانِ يَوْمَ ٱلْتَقَى ٱلْجَمْعَانِ وَٱللَّهُ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ"
      },
      {
        "index": "11",
        "sura": "9",
        "aya": "93",
        "name": "التوبة",
        "tname": "At-Tawba",
        "ename": "The Repentance",
        "text": "إِنَّمَا ٱلسَّبِيلُ عَلَى ٱلَّذِينَ يَسْتَـْٔذِنُونَكَ وَهُمْ أَغْنِيَآءُ رَضُوا۟ بِأَن يَكُونُوا۟ مَعَ ٱلْخَوَالِفِ وَطَبَعَ ٱللَّهُ عَلَىٰ قُلُوبِهِمْ فَهُمْ لَا يَعْلَمُونَ"
      },
      {
        "index": "12",
        "sura": "11",
        "aya": "6",
        "name": "هود",
        "tname": "Hud",
        "ename": "Hud",
        "text": "وَمَا مِن دَآبَّةٍ فِى ٱلْأَرْضِ إِلَّا عَلَى ٱللَّهِ رِزْقُهَا وَيَعْلَمُ مُسْتَقَرَّهَا وَمُسْتَوْدَعَهَا كُلٌّ فِى كِتَٰبٍ مُّبِينٍ"
      },
      {
        "index": "13",
        "sura": "12",
        "aya": "53",
        "name": "يوسف",
        "tname": "Yusuf",
        "ename": "Joseph",
        "text": "وَمَآ أُبَرِّئُ نَفْسِىٓ إِنَّ ٱلنَّفْسَ لَأَمَّارَةٌۢ بِٱلسُّوٓءِ إِلَّا مَا رَحِمَ رَبِّىٓ إِنَّ رَبِّى غَفُورٌ رَّحِيمٌ"
      },
      {
        "index": "14",
        "sura": "15",
        "aya": "1",
        "name": "الحجر",
        "tname": "Al-Hijr",
        "ename": "The Rock",
        "text": "الٓر تِلْكَ ءَايَٰتُ ٱلْكِتَٰبِ وَقُرْءَانٍ مُّبِينٍ"
      },
      {
        "index": "15",
        "sura": "17",
        "aya": "1",
        "name": "الإسراء",
        "tname": "Al-Israa",
        "ename": "The Night Journey",
        "text": "سُبْحَٰنَ ٱلَّذِىٓ أَسْرَىٰ بِعَبْدِهِۦ لَيْلًا مِّنَ ٱلْمَسْجِدِ ٱلْحَرَامِ إِلَى ٱلْمَسْجِدِ ٱلْأَقْصَا ٱلَّذِى بَٰرَكْنَا حَوْلَهُۥ لِنُرِيَهُۥ مِنْ ءَايَٰتِنَآ إِنَّهُۥ هُوَ ٱلسَّمِيعُ ٱلْبَصِيرُ"
      },
      {
        "index": "16",
        "sura": "18",
        "aya": "75",
        "name": "الكهف",
        "tname": "Al-Kahf",
        "ename": "The Cave",
        "text": "قَالَ أَلَمْ أَقُل لَّكَ إِنَّكَ لَن تَسْتَطِيعَ مَعِىَ صَبْرًا"
      },
      {
        "index": "17",
        "sura": "21",
        "aya": "1",
        "name": "الأنبياء",
        "tname": "Al-Anbiyaa",
        "ename": "The Prophets",
        "text": "ٱقْتَرَبَ لِلنَّاسِ حِسَابُهُمْ وَهُمْ فِى غَفْلَةٍ مُّعْرِضُونَ"
      },
      {
        "index": "18",
        "sura": "23",
        "aya": "1",
        "name": "المؤمنون",
        "tname": "Al-Muminoon",
        "ename": "The Believers",
        "text": "قَدْ أَفْلَحَ ٱلْمُؤْمِنُونَ"
      },
      {
        "index": "19",
        "sura": "25",
        "aya": "21",
        "name": "الفرقان",
        "tname": "Al-Furqaan",
        "ename": "The Criterion",
        "text": "وَقَالَ ٱلَّذِينَ لَا يَرْجُونَ لِقَآءَنَا لَوْلَآ أُنزِلَ عَلَيْنَا ٱلْمَلَٰٓئِكَةُ أَوْ نَرَىٰ رَبَّنَا لَقَدِ ٱسْتَكْبَرُوا۟ فِىٓ أَنفُسِهِمْ وَعَتَوْ عُتُوًّا كَبِيرًا"
      },
      {
        "index": "20",
        "sura": "27",
        "aya": "56",
        "name": "النمل",
        "tname": "An-Naml",
        "ename": "The Ant",
        "text": "فَمَا كَانَ جَوَابَ قَوْمِهِۦٓ إِلَّآ أَن قَالُوٓا۟ أَخْرِجُوٓا۟ ءَالَ لُوطٍ مِّن قَرْيَتِكُمْ إِنَّهُمْ أُنَاسٌ يَتَطَهَّرُونَ"
      },
      {
        "index": "21",
        "sura": "29",
        "aya": "46",
        "name": "العنكبوت",
        "tname": "Al-Ankaboot",
        "ename": "The Spider",
        "text": "وَلَا تُجَٰدِلُوٓا۟ أَهْلَ ٱلْكِتَٰبِ إِلَّا بِٱلَّتِى هِىَ أَحْسَنُ إِلَّا ٱلَّذِينَ ظَلَمُوا۟ مِنْهُمْ وَقُولُوٓا۟ ءَامَنَّا بِٱلَّذِىٓ أُنزِلَ إِلَيْنَا وَأُنزِلَ إِلَيْكُمْ وَإِلَٰهُنَا وَإِلَٰهُكُمْ وَٰحِدٌ وَنَحْنُ لَهُۥ مُسْلِمُونَ"
      },
      {
        "index": "22",
        "sura": "33",
        "aya": "31",
        "name": "الأحزاب",
        "tname": "Al-Ahzaab",
        "ename": "The Clans",
        "text": "وَمَن يَقْنُتْ مِنكُنَّ لِلَّهِ وَرَسُولِهِۦ وَتَعْمَلْ صَٰلِحًا نُّؤْتِهَآ أَجْرَهَا مَرَّتَيْنِ وَأَعْتَدْنَا لَهَا رِزْقًا كَرِيمًا"
      },
      {
        "index": "23",
        "sura": "36",
        "aya": "28",
        "name": "يس",
        "tname": "Yaseen",
        "ename": "Yaseen",
        "text": "وَمَآ أَنزَلْنَا عَلَىٰ قَوْمِهِۦ مِنۢ بَعْدِهِۦ مِن جُندٍ مِّنَ ٱلسَّمَآءِ وَمَا كُنَّا مُنزِلِينَ"
      },
      {
        "index": "24",
        "sura": "39",
        "aya": "32",
        "name": "الزمر",
        "tname": "Az-Zumar",
        "ename": "The Groups",
        "text": "فَمَنْ أَظْلَمُ مِمَّن كَذَبَ عَلَى ٱللَّهِ وَكَذَّبَ بِٱلصِّدْقِ إِذْ جَآءَهُۥٓ أَلَيْسَ فِى جَهَنَّمَ مَثْوًى لِّلْكَٰفِرِينَ"
      },
      {
        "index": "25",
        "sura": "41",
        "aya": "47",
        "name": "فصلت",
        "tname": "Fussilat",
        "ename": "Explained in detail",
        "text": "إِلَيْهِ يُرَدُّ عِلْمُ ٱلسَّاعَةِ وَمَا تَخْرُجُ مِن ثَمَرَٰتٍ مِّنْ أَكْمَامِهَا وَمَا تَحْمِلُ مِنْ أُنثَىٰ وَلَا تَضَعُ إِلَّا بِعِلْمِهِۦ وَيَوْمَ يُنَادِيهِمْ أَيْنَ شُرَكَآءِى قَالُوٓا۟ ءَاذَنَّٰكَ مَا مِنَّا مِن شَهِيدٍ"
      },
      {
        "index": "26",
        "sura": "46",
        "aya": "1",
        "name": "الأحقاف",
        "tname": "Al-Ahqaf",
        "ename": "The Dunes",
        "text": "حمٓ"
      },
      {
        "index": "27",
        "sura": "51",
        "aya": "31",
        "name": "الذاريات",
        "tname": "Adh-Dhaariyat",
        "ename": "The Winnowing Winds",
        "text": "قَالَ فَمَا خَطْبُكُمْ أَيُّهَا ٱلْمُرْسَلُونَ"
      },
      {
        "index": "28",
        "sura": "58",
        "aya": "1",
        "name": "المجادلة",
        "tname": "Al-Mujaadila",
        "ename": "The Pleading Woman",
        "text": "قَدْ سَمِعَ ٱللَّهُ قَوْلَ ٱلَّتِى تُجَٰدِلُكَ فِى زَوْجِهَا وَتَشْتَكِىٓ إِلَى ٱللَّهِ وَٱللَّهُ يَسْمَعُ تَحَاوُرَكُمَآ إِنَّ ٱللَّهَ سَمِيعٌۢ بَصِيرٌ"
      },
      {
        "index": "29",
        "sura": "67",
        "aya": "1",
        "name": "الملك",
        "tname": "Al-Mulk",
        "ename": "The Sovereignty",
        "text": "تَبَٰرَكَ ٱلَّذِى بِيَدِهِ ٱلْمُلْكُ وَهُوَ عَلَىٰ كُلِّ شَىْءٍ قَدِيرٌ"
      },
      {
        "index": "30",
        "sura": "78",
        "aya": "1",
        "name": "النبإ",
        "tname": "An-Naba",
        "ename": "The Announcement",
        "text": "عَمَّ يَتَسَآءَلُونَ"
      }
    ]
  }
}